<a href="https://colab.research.google.com/github/Pranay0799/Python-hero-to-zero-Assignment-submission/blob/main/Assignment_no_3_Data_Science.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
## First step is to import pandas

import pandas as pd
import numpy as np

In [2]:
## Day3 
##Assignment - Explore this dataset using pandas

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',
                 sep='\t')

In [3]:
df.head()

  item_code  ... sort_sequence
0       AA0  ...             2
1      AA0R  ...           399
2       SA0  ...             1
3      SA0E  ...           374
4     SA0L1  ...           358

[5 rows x 5 columns]

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
len(df)

399

In [6]:
df.shape

(399, 5)

In [7]:
df.head()

  item_code  ... sort_sequence
0       AA0  ...             2
1      AA0R  ...           399
2       SA0  ...             1
3      SA0E  ...           374
4     SA0L1  ...           358

[5 rows x 5 columns]

In [8]:
df.tail()

    item_code  ... sort_sequence
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[5 rows x 5 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_code      399 non-null    object
 1   item_name      399 non-null    object
 2   display_level  399 non-null    int64
 3   selectable     399 non-null    object
 4   sort_sequence  399 non-null    int64
dtypes: int64(2), object(3)
memory usage: 15.7+ KB

In [10]:
df.describe()

       display_level  sort_sequence
count     399.000000     399.000000
mean        3.192982     200.000000
std         1.817102     115.325626
min         0.000000       1.000000
25%         2.000000     100.500000
50%         3.000000     200.000000
75%         4.000000     299.500000
max         8.000000     399.000000

In [13]:
#Get the unique category counts
df['item_code'].value_counts()

SETB02     1
SEAG01     1
SEFG01     1
SEME       1
SEFN01     1
          ..
SEEB       1
SS62051    1
SS62054    1
SEFV05     1
SS0501A    1
Name: item_code, Length: 399, dtype: int64

In [14]:
df['item_name'].value_counts()

Frozen fruits and vegetables                          1
Food at elementary and secondary schools              1
Owners' equivalent rent of residences                 1
Care of invalids and elderly at home                  1
Distilled spirits, excluding whiskey, at home         1
                                                     ..
Private transportation                                1
Beer, ale, and other malt beverages away from home    1
Fats and oils                                         1
Apples                                                1
Dried beans, peas, and lentils                        1
Name: item_name, Length: 399, dtype: int64

In [17]:
df['display_level'].value_counts()

3    113
2     70
1     66
4     43
6     37
5     37
7     18
0     12
8      3
Name: display_level, dtype: int64

In [18]:
df['selectable'].value_counts()

T    399
Name: selectable, dtype: int64

In [19]:
df['sort_sequence'].value_counts()

399    1
125    1
127    1
128    1
129    1
      ..
269    1
270    1
271    1
272    1
1      1
Name: sort_sequence, Length: 399, dtype: int64

In [20]:
#Finding The Null Values
df.isnull()

     item_code  item_name  display_level  selectable  sort_sequence
0        False      False          False       False          False
1        False      False          False       False          False
2        False      False          False       False          False
3        False      False          False       False          False
4        False      False          False       False          False
..         ...        ...            ...         ...            ...
394      False      False          False       False          False
395      False      False          False       False          False
396      False      False          False       False          False
397      False      False          False       False          False
398      False      False          False       False          False

[399 rows x 5 columns]

In [21]:
#Count Of null values
df.isnull().sum()
#So there is no null values

item_code        0
item_name        0
display_level    0
selectable       0
sort_sequence    0
dtype: int64

In [22]:
df.corr()

               display_level  sort_sequence
display_level        1.00000       -0.70548
sort_sequence       -0.70548        1.00000

In [ ]:
#Thank You!!!!!!!!!!!!!!